Repository: mietmat-ristek/plugins
Catalog: RistekPluginSample/Strings/Strings.*.resx
Languages: pl

# adm_sample_plugin_member
source: Beam Truss with simplified input
pl: Stężenie (dodawanie uproszczone)

# insert_member_object_plugin
source: Add beam
pl: Dodaj belkę

# insertMemberBeetweenTwoExistRoofElements
source: Insert a member beetween two exist roof elements.
pl: Dodaj belkę pomiędzy dwoma istniejącymi elementami dachu"

source: Select the first beam
pl: Zaznacz pierwszą belkę

source: Select the second beam
pl: Zaznacz drugą belkę

# wrongInputType
source: Wrong input type. Please select timber beam
pl: Nieprawidłowy typ danych. Proszę wybrać belkę drewnianą

# pointsCannotBeTheSame
source: First and second point cannot be the same
pl: Pierwszy i drugi punkt nie mogą być takie same

# setRotationRelativeToTheRoofSlope
source: Set the rotation relative to the roof slope
pl: Ustaw obrót zgodny z nachyleniem dachu

# rotateBeam
source: Rotate the beam
pl: Obróć belkę

# drawBeam
source: Draw the beam
pl: Rysuj belkę

# fillInRequiredFields
source: Please complete all required fields
pl: Proszę uzupełnić wszystkie wymagane pola

source: Warning
pl: Ostrzeżenie

source: Set beam dimensions
pl: Ustaw wymiary belki

# horizontalDimension
source: Horizontal dimension [mm]
pl: Wymiar poziomy [mm]

# verticalDimension
source: Vertical dimension [mm]
pl: Wymiar pionowy [mm]

# setHorizontalInsertionFromReferencePart1
source: Set the beam horizontal insertion distance from reference
pl: Ustaw poziomą odległość wstawienia od początku belki

# setHorizontalInsertionFromReferencePart2
source: beam start point (to the new beam axis)
pl: referencyjnej (do osi wstawianej belki)

# distance
source: Distance [mm]
pl: Odległość [mm]

# setBeamMultiplication
source: Set the beam multiplication
pl: Ustaw duplikację belki

source: Multiply beam with spacing
pl: Duplikuj belkę w rozstawie

# alignementForNewBeam
source: Alignment for new beam
pl: Miejsce licowania nowej belki

# alignementForExistBeam
source: Alignment for exist beam
pl: Miejsce licowania istniejącej belki

# topEdge
source: Upper plane
pl: Górna płaszczyzna

# bottomEdge
source: Bottom plane
pl: Dolna płaszczyzna

source: Center
pl: Środek

source: Set beam extension
pl: Ustaw wydłużenie belki

# beamStartExtension
source: Beam start extension [mm]
pl: Wydłużenie początku belki [mm]

# beamEndExtension
source: Beam end extension [mm]
pl: Wydłużenie końca belki [mm]

source: beam height
pl: pionowy wymiar belki

source: beam thickness
pl: poziomy wymiar belki

source: beam horizontal insertion distance
pl: pozioma odległość wstawienia belki

source: beam multiply spacing
pl: rozstaw duplikacji belki

source: new beam alignement
pl: licowanie nowej belki

source: exist beam alignement
pl: licowanie istniejącej belki

# convertToMemberAlignementError
source: ConvertToMemberAlignment error for
pl: ConvertToMemberAlignment błąd dla

source: Wrong
pl: Błędna

source: Will be set to 0
pl: Ustawiono wartość 0

source: Unknown alignement option
pl: Nieznana opcja wyrównania

# _PlaneAlignementEnum_toAxis
source: to axis
pl: oś

# _PlaneAlignementEnum_toBottom
source: to bottom / back
pl: dół / tył

# _PlaneAlignementEnum_toTop
source: to top / front
pl: góra / przód

# _LoadingFileError
source: Unable to load file: {0}.
pl: Nie udało się odczytać pliku. \n Nazwa pliku: {0}

# _SavingFileError
source: Unable to save file: {0}.
pl: Nie udało się zapisać pliku. \\n Nazwa pliku: {0}

# _OffsetLengwiseBottomDesc
source: bottom edge distance
pl: odsunięcie od krawędzi dolnej

# _OffsetLengwiseTopDesc
source: top edge distance
pl: odsunięcie od krawędzi górnej

# _OffsetPerpendicularDesc
source: offset from plane
pl: dodatkowe obniżenie

# _PlaneAlignementDesc
source: plane alignement
pl: wyrównanie powierzchni

# _beamTrussesFolderNameInBuilding
source: Beam Trusses
pl: Stężenia

# _beamTrussNodeName
source: Beam Truss wind
pl: Stężenie wiatrowe

source: Dimension height
pl: Wymiar wysokość

source: Dimension length
pl: Wymiar długość

# _errorMembersNotParallel
source: First and second Member are not parallel
pl: Pierwszy i drugi pręt nie są równoległe

# _errorSameTruss
source: First and second truss cannot be the same
pl: Pierwszy i drugi wiązar pokrywają się

# _errorTrussesNotParallel
source: First and second truss are not parallel
pl: Pierwszy i drugi wiązar nie są równoległe

source: Incorrect input
pl: Niepoprawne działanie

# _LoadingFileError_DocumentSerializer
source: Failed to load file.\n{0}
pl: Nie udało się odczytać pliku.\n{0}

# _MenuToolTip
source: Generating beam truss between two selected trusses.
pl: Automatyczne dodawanie stężenia pomiędzy dwoma wskazanymi wiązarami.

# _preInputs0
source: Select Member in the first truss
pl: Wybierz belkę w pierwszym wiązarze

# _preInputs1
source: Select Member in the second truss
pl: Wybierz belkę w drugim wiązarze

# _preInputs2
source: Modify new beam truss alignment or press Enter (confirm) or ESC (cancel)
pl: Zmodyfikuj parametry utworzonego stężenia lub naciśnik Enter (zatwierdź stężęnie) lub ESC (anuluj dodawanie)

# _SavingFileError_DocumentSerializer
source: Failed to save data file.
pl: Nie udało się zapisać danych.

# _Support1
source: Beam Truss Support 1
pl: Podpora strężenia 1

# _Support2
source: Beam Truss Support 2
pl: Podpora strężenia 2

# _supportsFolderName
source: Supports
pl: Podpory

# _AutosetTrussParamsInEditModeDesc
source: autoset openings count
pl: automatycznie wyznacz liczbę segmentów

# _KnagaModeDesc
source: adding vertical heel blocking truss over support mode
pl: w trybie dodawania pionowej knagi powyżej podpory

# _preInputs0_extended
source: Select [option 1] Member in the first truss or [option 2] support
pl: [opcja 1] Wybierz belkę w pierwszym wiązarze lub [opcja 2] podporę pod knagą

# _errorMembersNotAboveSupport
source: Member is not located above Support
pl: Pręt nie zjaduje się nad podporą

# _OutreachPerpPrimaryDesc
source: outreach beyond perimeter A
pl: wysięg poza krawędź A

# _OutreachPerpSeccondaryDesc
source: outreach beyond perimeter B
pl: wysięg poza krawędź B

# _preInputs0_knaga
source: Select Member of Top Chord located above Support in the first truss
pl: Wybierz belkę pasa górnego zlokalizowaną nad podporą w pierwszym wiązarze

# _AutoaddSupportsDesc
source: generate beam truss with supports
pl: automatycznie generuj podpory

# _beamTrussKnagaNodeName
source: Heel blocking truss
pl: Knaga

source: Timber Beam
pl: Belka drewniana

source: Steel Beam
pl: Belka stalowa

source: Selection of beam type
pl: Wybór rodzaju belki
